; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l21_p21_c21_g21_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(person-at person1 loc6)
	(person-at person2 loc20)
	(person-at person3 loc8)
	(person-at person4 loc18)
	(person-at person5 loc10)
	(person-at person6 loc20)
	(person-at person7 loc6)
	(person-at person8 loc16)
	(person-at person9 loc18)
	(person-at person10 loc17)
	(person-at person11 loc3)
	(person-at person12 loc13)
	(person-at person13 loc10)
	(person-at person14 loc3)
	(person-at person15 loc1)
	(person-at person16 loc16)
	(person-at person17 loc21)
	(person-at person18 loc9)
	(person-at person19 loc17)
	(person-at person20 loc8)
	(person-at person21 loc4)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person12 food)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 medicine)
	(has-content-person person16 food)
	(has-content-person person16 medicine)
	(has-content-person person18 medicine)
	(has-content-person person20 medicine)
	(has-content-person person21 medicine)
))
)

; plan
1. (put-crate-in-carrier crate21 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate21 depot)
   added: (crate-at-space crate21 carrier1 space4)
   goals met: 1 of 22
2. (put-crate-in-carrier crate8 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space3)
   goals met: 1 of 22
3. (move-carrier depot loc17 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   goals met: 0 of 22
4. (pick-and-drop crate21 loc17 drone1 carrier1 space4 person10 medicine)
   deleted: (crate-at-space crate21 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person10 medicine)
   goals met: 1 of 22
5. (move-carrier loc17 depot drone1 carrier1)
   deleted: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 22
6. (put-crate-in-carrier crate20 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate20 depot)
   added: (crate-at-space crate20 carrier1 space4)
   goals met: 2 of 22
7. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 1 of 22
8. (pick-and-drop crate8 loc13 drone1 carrier1 space3 person12 food)
   deleted: (crate-at-space crate8 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person12 food)
   goals met: 2 of 22
9. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 22
10. (put-crate-in-carrier crate7 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space3)
   goals met: 3 of 22
11. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 2 of 22
12. (pick-and-drop crate20 loc9 drone1 carrier1 space4 person18 medicine)
   deleted: (crate-at-space crate20 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person18 medicine)
   goals met: 3 of 22
13. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 22
14. (put-crate-in-carrier crate19 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate19 depot)
   added: (crate-at-space crate19 carrier1 space4)
   goals met: 4 of 22
15. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 3 of 22
16. (pick-and-drop crate19 loc4 drone1 carrier1 space4 person21 medicine)
   deleted: (crate-at-space crate19 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person21 medicine)
   goals met: 4 of 22
17. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 22
18. (put-crate-in-carrier crate18 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space4)
   goals met: 5 of 22
19. (put-crate-in-carrier crate17 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space2)
   goals met: 5 of 22
20. (move-carrier depot loc20 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   goals met: 4 of 22
21. (pick-and-drop crate17 loc20 drone1 carrier1 space2 person2 medicine)
   deleted: (crate-at-space crate17 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 medicine)
   goals met: 5 of 22
22. (pick-and-drop crate7 loc20 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate7 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 6 of 22
23. (pick-and-drop crate18 loc20 drone1 carrier1 space4 person6 medicine)
   deleted: (crate-at-space crate18 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 medicine)
   goals met: 7 of 22
24. (move-carrier loc20 depot drone1 carrier1)
   deleted: (drone-at drone1 loc20) (carrier-at carrier1 loc20)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 22
25. (put-crate-in-carrier crate16 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space4)
   goals met: 8 of 22
26. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 8 of 22
27. (put-crate-in-carrier crate15 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space2)
   goals met: 8 of 22
28. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 7 of 22
29. (pick-and-drop crate15 loc18 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate15 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 8 of 22
30. (pick-and-drop crate6 loc18 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 9 of 22
31. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 22
32. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 10 of 22
33. (put-crate-in-carrier crate14 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space2)
   goals met: 10 of 22
34. (move-carrier depot loc16 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   goals met: 9 of 22
35. (pick-and-drop crate14 loc16 drone1 carrier1 space2 person16 medicine)
   deleted: (crate-at-space crate14 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person16 medicine)
   goals met: 10 of 22
36. (pick-and-drop crate5 loc16 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 11 of 22
37. (move-carrier loc16 depot drone1 carrier1)
   deleted: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 22
38. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 12 of 22
39. (put-crate-in-carrier crate13 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space2)
   goals met: 12 of 22
40. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 11 of 22
41. (pick-and-drop crate13 loc10 drone1 carrier1 space2 person13 medicine)
   deleted: (crate-at-space crate13 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person13 medicine)
   goals met: 12 of 22
42. (pick-and-drop crate4 loc10 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 13 of 22
43. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 14 of 22
44. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 14 of 22
45. (put-crate-in-carrier crate12 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space2)
   goals met: 14 of 22
46. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 13 of 22
47. (pick-and-drop crate12 loc8 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate12 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 14 of 22
48. (pick-and-drop crate3 loc8 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 15 of 22
49. (pick-and-drop crate16 loc8 drone1 carrier1 space4 person20 medicine)
   deleted: (crate-at-space crate16 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person20 medicine)
   goals met: 16 of 22
50. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 22
51. (put-crate-in-carrier crate11 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space4)
   goals met: 17 of 22
52. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 17 of 22
53. (put-crate-in-carrier crate10 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space2)
   goals met: 17 of 22
54. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 16 of 22
55. (pick-and-drop crate10 loc6 drone1 carrier1 space2 person1 medicine)
   deleted: (crate-at-space crate10 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 medicine)
   goals met: 17 of 22
56. (pick-and-drop crate2 loc6 drone1 carrier1 space3 person7 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person7 food)
   goals met: 18 of 22
57. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 22
58. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 19 of 22
59. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 18 of 22
60. (pick-and-drop crate1 loc3 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 19 of 22
61. (pick-and-drop crate11 loc3 drone1 carrier1 space4 person11 medicine)
   deleted: (crate-at-space crate11 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person11 medicine)
   goals met: 20 of 22
62. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 21 of 22
63. (put-crate-in-carrier crate9 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space4)
   goals met: 21 of 22
64. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 20 of 22
65. (pick-and-drop crate9 loc3 drone1 carrier1 space4 person14 medicine)
   deleted: (crate-at-space crate9 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person14 medicine)
   goals met: 21 of 22
66. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 22 of 22
